/* eslint-disable @next/next/no-img-element */
import { FC, memo } from "react";

const PrivacyPolicy: FC = () => (
  <>
    <section className="h-20 flex justify-center items-center mb-3 w-full">
      <h1 className="text-2xl font-bold text-slate-700 z-10">سياسة الخصوصية</h1>
    </section>

    <div className="card bg-base-100 border rounded-sm mb-5">
      <div className="card-body">
        <h4 className="font-bold">الخصوصية وبيان سريّة المعلومات</h4>
        <p className="text-justify">
          نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت.
          <br />
          لقد تم إعداد هذه السياسة لمساعدتكم في تفهم طبيعة البيانات التي نقوم
          بتجميعها منكم عند زيارتكم لموقعنا على شبكة الانترنت وكيفية تعاملنا مع
          هذه البيانات الشخصية.
        </p>
        <h4 className="font-bold">التصفح</h4>
        <p className="text-justify">
          لم نقم بتصميم هذا الموقع من أجل تجميع بياناتك الشخصية من جهاز
          الكمبيوتر الخاص بك أثناء تصفحك لهذا الموقع، وإنما سيتم فقط استخدام
          البيانات المقدمة من قبلك بمعرفتك ومحض إرادتك.
        </p>
        <h4 className="font-bold">عنوان بروتوكول شبكة الإنترنت (IP)</h4>
        <p className="text-justify">
          في أي وقت تزور فيه اي موقع انترنت بما فيها هذا الموقع، سيقوم السيرفر
          المضيف بتسجيل عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك وتاريخ ووقت
          الزيارة ونوع متصفح الإنترنت الذي تستخدمه والعنوان URL الخاص بأي موقع
          من مواقع الإنترنت التي تقوم بإحالتك إلى الى هذا الموقع على الشبكة.
        </p>
        <h4 className="font-bold">عمليات المسح على الشبكة</h4>
        <p className="text-justify">
          إن عمليات المسح التي نقوم بها مباشرة على الشبكة تمكننا من تجميع بيانات
          محددة مثل البيانات المطلوبة منك بخصوص نظرتك وشعورك تجاه موقعنا. تعتبر
          ردودك ذات أهمية قصوى ومحل تقديرنا حيث أنها تمكننا من تحسين مستوى
          موقعنا، ولك كامل الحرية والإختيار في تقديم البيانات المتعلقة بإسمك
          والبيانات الأخرى.
        </p>
        <h4 className="font-bold">الروابط بالمواقع الأخرى على شبكة الإنترنت</h4>
        <p className="text-justify">
          قد يشتمل موقعنا على روابط لمواقع الأخرى على شبكة الإنترنت أو إعلانات
          من مواقع اخرى مثل
          <a
            href="https://www.google.com/adsense"
            target="_blank"
            rel="noopener noreferrer"
          >
            Google AdSense
          </a>
          ولا نعتبر مسئولين عن أساليب تجميع البيانات من قبل تلك المواقع، يمكنك
          الاطلاع على سياسات الخصوصية والمحتويات الخاصة بتلك المواقع التي يتم
          الدخول إليها من خلال الرابط المخصص لهذه المعلومات ضمن تلك المواقع.
        </p>
        <p className="text-justify">
          نحن قد نستعين بشركات إعلان لأطراف ثالثة لعرض الإعلانات عندما تزور
          موقعنا على الويب. يحق لهذه الشركات أن تستخدم معلومات حول زياراتك لهذا
          الموقع ولمواقع الويب الأخرى (باستثناء الاسم أو العنوان أو عنوان البريد
          الإلكتروني أو رقم الهاتف)، وذلك من أجل تقديم إعلانات حول البضائع
          والخدمات التي تهمك. إذا كنت ترغب في مزيد من المعلومات حول هذا الأمر
          وكذلك إذا كنت تريد معرفة الاختيارات المتاحة لك لمنع استخدام هذه
          المعلومات من قِبل هذه الشركات،{" "}
          <a
            href="https://www.google.com/privacy_ads.html"
            target="_blank"
            rel="noopener noreferrer"
          >
            فالرجاء النقر هنا
          </a>
          .
        </p>
        <h4 className="font-bold">إفشاء المعلومات</h4>
        <p className="text-justify">
          سنحافظ في كافة الأوقات على خصوصية وسرية كافة البيانات الشخصية التي
          نتحصل عليها، ولن يتم إفشاء هذه المعلومات إلا إذا كان ذلك مطلوبًا بموجب
          أي قانون أو عندما نعتقد بحسن نية أن مثل هذا الإجراء سيكون مطلوبًا أو
          مرغوبًا فيه للتماشي مع القانون أو للدفاع عن أو حماية حقوق الملكية
          الخاصة بهذا الموقع أو الجهات المستفيدة منه.
        </p>
        <h4 className="font-bold">
          البيانات اللازمة لتنفيذ المعاملات المطلوبة من قبلك
        </h4>
        <p className="text-justify">
          عندما نحتاج إلى أية بيانات خاصة بك، فإننا سنطلب منك تقديمها بمحض
          إرادتك حيث ستساعدنا هذه المعلومات في الاتصال بك وتنفيذ طلباتك حيثما
          كان ذلك ممكننًا. لن يتم اطلاقًا بيع البيانات المقدمة من قبلك إلى أي
          طرف ثالث بغرض تسويقها لمصلحته الخاصة دون الحصول على موافقتك المسبقة
          والمكتوبة ما لم يتم ذلك على أساس أنها ضمن بيانات جماعية تستخدم للأغراض
          الإحصائية والأبحاث دون اشتمالها على أية بيانات من الممكن استخدامها
          للتعريف بك.
        </p>
        <h4 className="font-bold">عند الاتصال بنا</h4>
        <p className="text-justify">
          سيتم التعامل مع كافة البيانات المقدمة من قبلك على أساس أنها سرية.
          تتطلب النماذج التي يتم تقديمها مباشرة على الشبكة تقديم البيانات التي
          ستساعدنا في تحسين موقعنا. سيتم استخدام البيانات التي يتم تقديمها من
          قبلك في الرد على كافة استفساراتك، ملاحظاتك، أو طلباتك من قبل هذا
          الموقع.
        </p>
        <h4 className="font-bold">إفشاء المعلومات لأي طرف ثالث</h4>
        <p className="text-justify">
          لن نقوم ببيع أو تأجير أو المتاجرة أو إفشاء أية معلومات لمصلحة أي طرف
          ثالث خارج هذا الموقع. وسيتم الكشف عن المعلومات فقط في حالة صدور أمر
          بذلك من قبل أي سلطة قضائية أو تنظيمية.
        </p>
        <h4 className="font-bold">
          التعديلات على سياسة سرية وخصوصية المعلومات
        </h4>
        <p className="text-justify">
          نحتفظ بالحق في تعديل بنود وشروط سياسة سرية وخصوصية المعلومات إن لزم
          الأمر ومتى كان ذلك ملائمًا، وسيتم إضافة التعديلات على هذه الصفحة.
        </p>
        <h4 className="font-bold">الاتصال بنا</h4>
        <p className="text-justify">
          يمكنكم الاتصال بنا عند الحاجة من خلال الضغط على رابط اتصل بنا.
        </p>
        <h4 className="font-bold">اخيرًا</h4>
        <p className="text-justify">
          إن مخاوفك واهتمامك بشأن سرية وخصوصية البيانات تعتبر مسألة في غاية
          الأهمية بالنسبة لنا. نحن نأمل أن يتم تحقيق ذلك من خلال هذه السياسة.
        </p>
      </div>
    </div>
  </>
);

export default memo(PrivacyPolicy);
